{"id":43223,"date":"2023-11-04T02:43:27","date_gmt":"2023-11-04T07:43:27","guid":{"rendered":"http:\/\/osiriuniversity.org\/?p=43223"},"modified":"2023-11-04T16:51:45","modified_gmt":"2023-11-04T21:51:45","slug":"shattering-the-myth-the-triumph-of-african-voices-over-racism","status":"publish","type":"post","link":"https:\/\/osiriuniversity.org\/shattering-the-myth-the-triumph-of-african-voices-over-racism\/","title":{"rendered":"Shattering the Myth: The Triumph of African Voices over Racism"},"content":{"rendered":"<p>Over the last century, there has been a concerted effort to bring the African story to the forefront of academic conversation. It began as an effort to challenge a racist narrative that Africa and her people have contributed nothing to human culture, civilization, and progress. This nefarious perspective was born out of the European pseudo-sciences of the 18th and 19th centuries, which endeavored only to prove that Europeans were the pinnacle of human genius and ingenuity. While all other peoples were to be understood as diluted and not-quite-evolved branches of humanity who were in need of Europeans to lift them out of the muck and mire of their own cultural inferiorities.<\/p>\n<p>African people did not accept these notions, but Europeans had control of the narrative in large part because they controlled the ebb-and-flow of the written word, both in the press and in the halls of academia. Still, no matter how stony the road we trod, our time would come. At the turn of the 20th century, two academic giants decided it was our time to make our mark on the world. First came Carter G. Woodson, a giant who understood the critical importance of history and a people’s narrative. This giant founded the Association for the Study of African American Life and History, The Journal of Negro History, and Negro History Week, which would become Black History Month. These efforts exploded the erroneous Eurocentric notions of humanity’s cultural beginnings. Further, his seminal text The Mis-Education of the Negro in America was and is a critically important text focused on the destruction of Eurocentric mythos and the development of human-centered knowledge, which would help to uplift African people across the world.<\/p>\n<p>Next, the work of Arturo Alfonso Schomburg solidified the effort to reclaim the narrative of African people during the Harlem Renaissance. In 1911, Arturo Schomburg with John Edward Bruce founded the Negro Society for Historical Research to bring together African scholars from across the diaspora and the continent to contribute to the effort of restructuring the global narrative of African people. Schomburg’s work had far-reaching consequences, directly and indirectly contributing to the efforts of scholarly and political giants such as John Henrick Clarke, Kwame Nkrumah, Marcus Garvey, and Zora Neale Hurston.<\/p>\n<p>The groundwork laid by Woodson and Schomburg would help define what was to become a movement that would legitimize Africana Studies (also called: Afro-American Studies, Black Studies, or African American Studies). This discipline was the product of the efforts of the Harlem Renaissance, the Civil Rights Movement, the Black Power Movement, and the Anti-Colonial Movement of the Caribbean Basin and on the continent of Africa. By the late 1960s, the effort to solidify the presence of Africana Studies on college campuses in the US would become a reality.<\/p>\n<p>New Africana departments and programs were being developed throughout the Western Hemisphere in the 70s, 80s and 90s. University degrees at all levels were offered and earned by thousands of students who themselves only wanted to fill the holes in the historical and cultural narrative that was still being taught in primary and secondary schools. Furthermore, the development of Africana Studies as a discipline helped to contribute to and inspire others to develop culturally focused disciplines of their own, such as Latinx Studies, Asian Studies and Native American Studies. Women or Gender Studies programs and departments also emerged, strengthening and transforming Humanities and Liberal Arts in universities all over the world.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the last century, there has been a concerted effort to bring the African story to the forefront of academic<span class=\"excerpt-hellip\"> […]<\/span><\/p>\n","protected":false},"author":192,"featured_media":43227,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"slim_seo":[],"footnotes":""},"categories":[226],"tags":[],"_links":{"self":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts\/43223"}],"collection":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/users\/192"}],"replies":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/comments?post=43223"}],"version-history":[{"count":0,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts\/43223\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/media\/43227"}],"wp:attachment":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/media?parent=43223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/categories?post=43223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/tags?post=43223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}