{"id":43228,"date":"2023-11-05T08:50:01","date_gmt":"2023-11-05T14:50:01","guid":{"rendered":"http:\/\/osiriuniversity.org\/?p=43228"},"modified":"2023-11-05T09:02:09","modified_gmt":"2023-11-05T15:02:09","slug":"the-evolution-of-education-osiri-universitys-commitment-to-ubuntu-innovation-and-global-impact","status":"publish","type":"post","link":"https:\/\/osiriuniversity.org\/the-evolution-of-education-osiri-universitys-commitment-to-ubuntu-innovation-and-global-impact\/","title":{"rendered":"The Evolution of Education: Osiri University’s Commitment to Ubuntu, Innovation, and Global Impact"},"content":{"rendered":"<p>Osiri University is the culmination of an unwavering commitment to build upon the legacy of intellectual and cultural luminaries who have paved the way before us. In essence, Osiri University represents the progressive evolution of education. Our mission at Osiri University is to harness the power of diverse and all-encompassing cultural paradigms, notably the deeply inclusive philosophy of Ubuntu, prevalent across Africa, to enlighten and elevate the global community.<\/p>\n<p>Ubuntu, the profound African philosophy encapsulated in the phrase “I am because we are,” offers boundless inspiration and potential. At Osiri University, we instill in our learners the remarkable capacity to discover the unity of humanity within themselves, igniting a transformative journey toward self-discovery and global impact.<\/p>\n<p>Our mission at Osiri University is to empower students to harness their strengths, cultivate their core values, and the knowledge to become changemakers in our interconnected world. We challenge them to draw upon their rich history, cultural heritage, and imagination as a wellspring of solutions for their local communities. We firmly believe that the key to addressing the world’s challenges lies within the diverse cultures and talents of the people, waiting to be nurtured and harnessed.<\/p>\n<p>While Ubuntu originates from the heart of Africa, its significance transcends geographical boundaries. It is a philosophy to be shared with the world, transforming the idea of “I am because we are” into a university mantra for all of humanity. As Dr. John Henrik Clarke eloquently expressed, “We gave the world its first humanity, maybe we have the capacity to give the world its next humanity.” At Osiri University, we teach our students to embody Ubuntu by embracing compassion, building strong communities, fostering cooperation within their families and friendships, and seeking shared prosperity with partners and stakeholders. We strive to mold students into leaders who will bring about meaningful change.<\/p>\n<p>Our institution is solution-oriented, and dedicated to transforming learners into visionary leaders. We offer a cutting-edge curriculum that blends modern advancements with the wisdom of the student’s own communities to drive sustainable innovation. For example, our BBA in Business Intelligence and MSc in Data and Information Systems include courses leading to industry certifications in fields such as Artificial Intelligence, Cybersecurity, Data Science, and the Internet of Things.<\/p>\n<p>At Osiri University, we are privileged to have outstanding professors and seasoned practitioners who are renowned in their respective fields. Our students benefit from small class sizes, fostering meaningful connections, profound mentorships, and individualized education experiences. We believe that true success requires not only intelligence and hard work but also unwavering integrity &#8211; a commitment to an ethical way of life. Our rigorous programs impart a relevant skillset and a dedication to truth and justice.<\/p>\n<p>In essence, Osiri University is not merely a place of learning; it is a nurturing ground for future leaders, guided by the philosophy of Ubuntu, where humanity, compassion, and wisdom unite to illuminate a brighter path forward for all.<\/p>\n<p><b>AUTHORS:<\/b><br \/>\n<em>Dr. Paul Easterling is the Dean of Humanities and Vice President of Academic Affairs at Osiri University<\/em><br \/>\n<em>Prof. Kalu Osiri is the Founder of Osiri University, Creator of MARVEL, and Host of the Ubuntu Community<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Osiri University is the culmination of an unwavering commitment to build upon the legacy of intellectual and cultural luminaries who<span class=\"excerpt-hellip\"> […]<\/span><\/p>\n","protected":false},"author":423,"featured_media":43230,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"slim_seo":[],"footnotes":""},"categories":[226],"tags":[],"_links":{"self":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts\/43228"}],"collection":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/users\/423"}],"replies":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/comments?post=43228"}],"version-history":[{"count":0,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/posts\/43228\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/media\/43230"}],"wp:attachment":[{"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/media?parent=43228"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/categories?post=43228"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/osiriuniversity.org\/wp-json\/wp\/v2\/tags?post=43228"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}